work/WinVent/Kastenfenster/V01/constant/fvMesh/polyFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceLabelField;
    location    "constant/fvMesh";
    object      polyFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform -1;

boundaryField
{
    innerInlet
    {
        type            polyFaces;
    }
    atmosphere_outlet
    {
        type            polyFaces;
    }
    rotorBlades
    {
        type            polyFaces;
    }
    rotorBlades_slave
    {
        type            polyFaces;
    }
    walls
    {
        type            polyFaces;
    }
    window
    {
        type            polyFaces;
    }
    nonCouple1
    {
        type            polyFaces;
    }
    nonCouple2
    {
        type            polyFaces;
    }
    nonConformalCyclic_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            1203;
        value           nonuniform List<label> 
1203
(
503602
503603
503604
503605
503606
503607
503608
503609
...
)
;
    }
    nonConformalCyclic_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            1203;
        value           nonuniform List<label> 
1203
(
504786
504787
504788
504789
504790
504791
504792
504793
...
)
;
    }
    nonConformalError_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
}


// ************************************************************************* //
