work/WinVent/Kastenfenster/V01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    innerInlet
    {
        type            wall;
        inGroups        List<word> 
2
(
atmosphere
wall
)
;
        nFaces          276;
        startFace       343560;
    }
    atmosphere_outlet
    {
        type            patch;
        inGroups        List<word> 1(atmosphere);
        nFaces          4292;
        startFace       343836;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 
2
(
staticWalls
wall
)
;
        nFaces          10286;
        startFace       348128;
    }
    window
    {
        type            wall;
        inGroups        List<word> 
2
(
staticWalls
wall
)
;
        nFaces          6276;
        startFace       358414;
    }
)

// ************************************************************************* //
