work/WinVent/Kastenfenster/V01/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    ph_rgh
    {
        $p_rgh;
    }

    MeshPhi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-4;
        relTol          0;
    }

    "(rho|U|h|e|k|epsilon|omega|CO2|Y_CO2|specificHumidity)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.001;
    }

    "(rho|U|h|e|k|epsilon|omega|CO2|Y_CO2|specificHumidity)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    correctMeshPhi      yes;
    nOuterCorrectors    3;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;

    hydrostaticInitialisation yes;
    nHydrostaticCorrectors 5;
}

relaxationFactors
{
    equations
    {
        "(U|h|k|epsilon|omega).*" 0.7; //1;
    }
}


// ************************************************************************* //
